# Homebrew Taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# ------------------
#
#    Applications
#
# ------------------

# Terminal
cask "iterm2"

# Alfred
cask "alfred"

# Google Chrome
cask "google-chrome"

# Visual Studio Code
cask "visual-studio-code"

# JetBrains Toolbox
cask "jetbrains-toolbox"

# VirtualBox
cask "virtualbox"

# Kubernetes
cask "minikube"
brew "kubernetes-cli"

# Google Cloud SDK
cask "google-cloud-sdk"

# ------------------
#       Fonts
# ------------------

# FuraCode, FuraMono & Hack
cask "font-firacode-nerd-font"
cask "font-firamono-nerd-font"
cask "font-hack-nerd-font"

# ------------------
#
#      Formulae
#
# ------------------

# ------------------
#        Core
# ------------------

# Shells
brew "bash"
brew "bash-completion@2"
brew "fish"
brew "zsh"

# Vim and Neovim!
brew "ed"
brew "vim"
brew "neovim"

# ------------------
#        Git
# ------------------

# Git
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "bfg"
brew "gist"

# Hub (Git Replacement for GitHub)
brew "hub"

# ------------------
#    Programming
# ------------------

# NodeJS, Yarn
brew "node", link: false
brew "yarn", ignore_dependencies: true

# Go
brew "go"

# Protobuf
brew "protobuf"

# ngrok
cask "ngrok"

# ------------------
#     Utilities
# ------------------

# Install `wget` with IRI support.
brew "wget", args: ["with-iri"]

# TLDR - Shell Explainer
brew "tldr"

# FD - User-friendly `find`
brew "fd"

# FZF - command-line fuzzy finder
brew "fzf"

# FX - Command-line JSON processing tool
brew "fx"