# Homebrew Taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# ------------------
#
#    Applications
#
# ------------------

# ------------------
#    Productivity
# ------------------

# Terminal
cask "iterm2"
cask "alacritty"

# Alfred
cask "alfred"

# Google Chrome
cask "google-chrome"

# Karabiner-elements
cask "karabiner-elements"

cask "hammer-spoon"

# ------------------
#    Development
# ------------------

# Visual Studio Code
cask "visual-studio-code"

# JetBrains Toolbox
cask "jetbrains-toolbox"

# lens
cask "lens"

# Fork
cask "fork"

# Docker
cask "docker"
tap "wagoodman/dive"
brew "dive"
tap "jesseduffield/lazydocker"
brew "lazydocker"

# Kubernetes
brew "kubernetes-cli"
# brew "kops"
brew "kubectx"
# brew "minikube"

# Google Cloud SDK
cask "google-cloud-sdk"

# ------------------
#    Daily Usage
# ------------------

cask "slack"
cask "discord"
cask "spotify"
cask "iina"
cask "flux"
cask "the-unarchiver"
cask "kindle"
cask "send-to-kindle"

# ------------------
#       Fonts
# ------------------

# FuraCode, FuraMono & Hack
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# ------------------
#
#      Formulae
#
# ------------------

# ------------------
#        Core
# ------------------

# Shells
brew "bash"
brew "bash-completion@2"
brew "fish"
brew "zsh"

# Vim and Neovim!
brew "ed"
brew "vim"
brew "neovim"

brew "wget"

# ------------------
#        Git
# ------------------

# Git
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
# brew "bfg"
brew "gist"
brew "git-crypt"

# Hub (Git Replacement for GitHub)
brew "hub"
brew "gh"

# ------------------
#    Programming
# ------------------

# NodeJS, Yarn (use NVM instead)
# brew "node", link: false
# brew "yarn", ignore_dependencies: true
# brew "volta"

# Python
# brew "pyenv"
# brew "pyenv-virtualenv"

# Go
brew "go"

# Protobuf
brew "protobuf"

# ngrok
cask "ngrok"

# ------------------
#     Utilities
# ------------------

# Thefuck - Magnificent app which corrects your previous console command.
brew "thefuck"

# Mac App Store command line interface
brew "mas"

# TLDR - Shell Explainer
brew "tldr"

# BAT - A cat(1) clone with wings.
brew "bat"

# FD - User-friendly `find`
brew "fd"

# FZF - command-line fuzzy finder
# brew "fzf"

# Search tools
brew "the_silver_searcher"
brew "ripgrep"

# FX - Command-line JSON processing tool
brew "fx"
brew "jq"

# tree - Show the contents of the current directory as a tree.
brew "tree"
